# AWS
brew "aws-vault"

# JSON processing
brew "jq"

# Git
brew "git-lfs"
brew "gh"
brew "pre-commit"
brew "gettext"  # Provides envsubst, used by setup-gitconfig.sh

# FZF
brew "fzf"

# Pyenv
brew "pyenv"
brew "pyenv-virtualenv"

# Pyenv dependencies
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"

# Pass
brew "pass"
cask "qtpass"

# Ruby
brew "chruby"
brew "ruby-install"

# GnuPG
brew "gnupg"
brew "pinentry-mac"

# Monitoring
brew "bmon"

# PostgreSQL
brew "libpq"

# Install if `canvas` is not compatible with Node.js
# brew "cairo"
# brew "pango"
